Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/recreational_activities_in_ireland/sport_and_leisure/go_for_life.html.txt.tmx
Source language: en
Languages: ga

source: Go for Life programme
ga: An Clár Go For Life

source: Go for Life is the national programme for sport and physical activity for older people
ga: Is é ‘Beir Beo ar an Saol’ (‘Go for Life’) an clár náisiúnta le haghaidh spóirt agus gníomhaíocht fhisiciúil i measc daoine scothaosta

source: The aim of Go for Life is to involve greater numbers of older adults in all aspects of sport and physical activity
ga: Is é cuspóir Beir Beo ar an Saol go mbeidh baint ag líonta níos mó de dhaoine scothaosta i ngach gné den spórt agus den ghníomhaíocht fhisiciúil

source: It is run by Age & Opportunity in partnership with the Health Promotion and Improvement Offices of the Health Service Executive (HSE) and the Local Sports Partnerships
ga: Tá an clár á reáchtáil ag Age & Opportunity i gcomhpháirt le hOifigí Chothú na Sláinte agus Feabhsúcháin d’Fheidmeanancht na Seirbhíse Sláinte (FSS) agus leis na Comhpháirtíochtaí Spóirt Áitiúla

source: The Go for Life programme has 4 different elements:
ga: Tá ceithre ghné ar leith sa chlár Beir Bua ar an Saol:

source: • Physical Activity Awareness Programme
ga: • An Clár Feasachta ar Ghníomhaíocht Fhisiciúil

source: The Leadership Programme aims to promote greater participation by independent older people in all aspects of health-enhancing physical activity and recreational sports
ga: Tá sé mar aidhm ag an gClár Ceannaireachta rannpháirtíocht fheabhsaithe a chur chun cinn i measc daoine neamhspleácha aosta i ngach gné de ghníomhaíocht fhisiciúil a chuireann an tsláinte chun cinn agus i spóirt chaitheamh aimsire

source: Go for Life tutors are available to train local physical activity leaders (PAL) in physical activity with older people
ga: Tá fáil ar theagascóirí Beir Bua ar an Saol chun oiliúint a chur ar cheannairí áitiúla gníomhaíochta fisiciúla (PAL) i ngníomhaíocht fhisiciúil le daoine aosta

source: PALs tend to be members of community groups, such as active retirement associations or day centre workers
ga: Is gnách gur baill de ghrúpaí pobail iad PALanna, ar nós comhlachais scoir ghníomhaigh nó oibrithe ionad lae

source: Around the country, there are over 1,200 active PALs
ga: Ar fud na tíre, tá breis agus 1,200 PAL gníomhach

source: The targeted initiatives promote greater participation by dependent or disadvantaged older people
ga: Cuireann na spriocthionscnaimh rannpháirtíocht fheabhsaithe chun cinn i measc daoine neamhspleácha nó daoine aosta atá faoi mhíbhuntáiste

source: The National Grant Scheme for Sport and Physical Activity for Older People is a government initiative aimed at encouraging older members of the community to participate in sport and physical activity
ga: Tionscnamh rialtais is ea an Scéim Náisiúnta Deontais do Spórt agus Gníomhaíocht Fhisiciúil i measc Daoine Aosta atá dírithe ar mhuintir aosta an phobail a spreagadh chun páirt a ghlacadh i spórt agus i ngníomhaíocht fhisiciúil

source: The scheme is aimed at:
ga: Tá an scéim dírithe ar an méid a leanas a dhéanamh:

source: • Helping clubs and organisations to enhance existing opportunities for their members in recreational sport and activities
ga: • Cabhrú le clubanna agus le heagraíochtaí chun na deiseanna reatha a fheabhsú atá ann lena mbaill sa spórt agus i ngníomhaíochtaí caitheamh aimsire

source: • Helping clubs and organisations to progress new initiatives geared at involving older people in recreational sport and activities
ga: • Cabhrú le clubanna agus le heagraíochtaí chun tionscnaimh nua a chur chun cinn atá dírithe ar rannpháirtíocht daoine aosta a spreagadh sa spórt agus i ngníomhaíochtaí caitheamh aimsire

source: Applications for funding under the National Grant Scheme are usually invited from local clubs and organisations wishing to implement initiatives, through advertisements in the press and media
ga: Is gnách go bhfáiltíonn clubanna agus eagraíochtaí áitiúla roimh iarratais ar chistiú faoin Scéim Náisiúnta Deontais ar mian leo tionscnaimh a chur i bhfeidhm, trí fhógraí sna nuachtáin agus sna meáin

source: Physical Activity Awareness Programme
ga: An Clár Feasachta ar Ghníomhaíocht Fhisiciúil

source: The Physical Activity Awareness Programme aims to increase older people’s awareness of the benefits of an active lifestyle and of the wide range of opportunities for involvement in active living and recreational sport
ga: Tá sé de chuspóir ag an gClár Feasachta ar Ghníomhaíocht Fhisicúil an fheasacht atá i measc daoine aosta a mhéadú ar na tairbhí atá le baint ó stíl mhaireachtála ghníomhach agus ón réimse fairsing deiseanna atá ann chun bheith páirteach i maireachtáil ghníomhach agus sa spórt caitheamh aimsire

source: Go for Life FitLine is a telephone-based service that encourages you to get more active
ga: Tá Go for Life FitLine seirbhís teileafóin-bhunaithe a spreagann tú a fháil níos gníomhaí
